Revit 2026 API

# ReinforcementRoundingManager Properties

---

The ReinforcementRoundingManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Element | The owner of the reinforcement rounding overrides. |
|  | IsActiveOnElement | Defines whether reinforcement rounding is activated for the particular element. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ReinforcementRoundingManager Class

Autodesk.Revit.DB.Structure Namespace